<div class="col-lg-9 col-sm-9 tutorial_desc">
	<span class="general">
      우리는 일상생활에서 '<span class="red">프로그램</span>'이라는 단어를 많이 사용합니다.<br>
	  그렇다면 프로그램은 무엇을 말하는 것일까요?<br><br>
	  흔히 컴퓨터 프로그램을 만들기 위해서는 C언어를 알아야 한다고 말합니다.<br>
	  C언어만 알면 모든 프로그램을 만들 수 있을까요?<br><br>
      C언어를 공부한 사람들은 '<span class="red">포인터</span>'에 대해 이야기 합니다.<br>
	  C언어와 친숙해질 수 없게 만드는 포인터란 녀석은 어떤 것일까요?<br><br>
	  사실 C언어는 언제든 여러분과 친해질 준비가 되어 있습니다. ^^ <br>
	  아직도 C언어는 어렵다는 선입견에 빠진 분들이 있다면 지금부터 이 녀석의 실체를 하나씩 파헤쳐 봅시다!<br>


	  
      



	</span>






































</div>
