<div class="col-lg-9 col-sm-9 tutorial_desc">
    <span class="general">    
        <ul>
            <li>프로그램이 사용하는 데이터들의 집합을 '파일'이라 한다.</li><br>
            <li>파일은 저장되는 형식에 따라 '텍스트 파일'과 '이진 파일'의 두 종류로 구분된다.</li><br>
            <li>C 언어에서는 프로그램이 직접적으로 파일로부터 데이터를 입력 받거나 파일에 데이터를 쓰지 않는다.</li><br>
            <li>넓은 의미로서 프로그램은 모든 기기를 '파일'로 취급한다.</li><br>
            <li>기기에 상관없이 파일 입출력이 이루어질 때는 '스트림(stream) 이라는 매개체를 거친다.</li><br>
            <li>서로 직접적으로 관여하지 않으므로 상이한 기기들간의 속도 차이를 보완해주는 역할을 한다.</li><br>
            <li>스트림 파일안의 버퍼를 통해 일정 크기의 데이터를 한번에 저장해 두었다가 입력, 출력을 한다.</li><br>
             
        </ul>
    </span>
</div>
